system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.0041  0       -0.005) //0
    ( 0       0       -0.005) //1
    ( 0.0041  0.001740346746  -0.005)  //2
    (-0.0041  0.03 -0.005) //3
    ( 0       0.03 -0.005) //4
    (0.0041  0.03 -0.005) //5 
    (0.0082   0.001740346746 -0.005) //6
    (0.0082   0.03 -0.005) //7

    (-0.0041  0        0.005) //8
    ( 0       0        0.005) //9
    ( 0.0041  0.001740346746 0.005) //10
    (-0.0041  0.03  0.005) //11
    ( 0       0.03  0.005) //12
    ( 0.0041  0.03  0.005) //13
    (0.0082   0.001740346746 0.005) //14
    (0.0082   0.03 0.005)   //15
);

blocks
(
    hex (0 1 4 3 8 9 12 11 ) (80 200 1) simpleGrading (1 8 1)
    hex (1 2 5 4 9 10 13 12) (80 200 1) simpleGrading (1 8 1)
    hex (2 6 7 5 10 14 15 13) (20 200 1) simpleGrading (5 8 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 11 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 7 15 14)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 9 8)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 11 12 4)
            (4 12 13 5)
	    (5 13 15 7)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (1 2 10 9)
	    (2 6 14 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
